## 1. Reshaping Data

### 1-1. .melt() : 열 이름을 행 값으로, 즉 value로 보내는 메서드

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'A': {0: 'a', 1: 'b', 2: 'c'},
    'B': {0: 1, 1: 3, 2: 5},
    'C': {0: 2, 1: 4, 2: 6}
})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [3]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [5]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [4]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [6]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable value
0        A     a
1        A     b
2        A     c
3        B     1
4        B     3
5        B     5
6        C     2
7        C     4
8        C     6

In [7]:
pd.melt(df, value_vars=['A', 'B', 'C']).rename(columns={'variable': '가', 'value': '값'})

   가  값
0  A  a
1  A  b
2  A  c
3  B  1
4  B  3
5  B  5
6  C  2
7  C  4
8  C  6

In [8]:
pew = pd.read_csv('./../data/pew.csv')
pew

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116
5,Evangelical Prot,575,869,1064,982,881,1486,949,723,414,1529
6,Hindu,1,9,7,9,11,34,47,48,54,37
7,Historically Black Prot,228,244,236,238,197,223,131,81,78,339
8,Jehovah's Witness,20,27,24,24,21,30,15,11,6,37
9,Jewish,19,19,25,25,30,95,69,87,151,162
10,Mainline Prot,289,495,619,655,651,1107,939,753,634,1328
11,Mormon,29,40,48,51,56,112,85,49,42,69
12,Muslim,6,7,9,10,9,23,16,8,6,22
13,Orthodox,13,17,23,32,32,47,38,42,46,73
14,Other Christian,9,7,11,13,13,14,18,14,12,18
15,Other Faiths,20,33,40,46,49,63,46,40,41,71
16,Other World Religions,5,2,3,4,2,7,3,4,4,8
17,Unaffiliated,217,299,374,365,341,528,407,321,258,597

In [9]:
pew2 = pd.melt(pew, id_vars='religion')
pew2

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [10]:
pew2.iloc[[0, 1, 2, 18, 19, 20], :]

    religion variable  value
0   Agnostic    <$10k     27
1    Atheist    <$10k     12
2   Buddhist    <$10k     27
18  Agnostic  $10-20k     34
19   Atheist  $10-20k     27
20  Buddhist  $10-20k     21

In [11]:
pew3 = pd.melt(pew, id_vars='religion', var_name='income', value_name='count')
pew3

                  religion              income  count
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [12]:
billb = pd.read_csv('./../data/billboard.csv')
billb

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,87,82.0,72.0,77.0,87.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,91,87.0,92.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,81,70.0,68.0,67.0,66.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,3 Doors Down,Loser,4:24,2000-10-21,76,76.0,72.0,69.0,67.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,57,34.0,25.0,17.0,17.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
312,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,86,83.0,77.0,74.0,83.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
313,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,85,83.0,83.0,82.0,81.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
314,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,95,94.0,91.0,85.0,84.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
315,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,99,99.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
316,2000,matchbox twenty,Bent,4:12,2000-04-29,60,37.0,29.0,24.0,22.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
billb2 = pd.melt(billb, id_vars=['year', 'artist', 'track', 'time', 'date.entered'],
                 var_name='week', value_name='rationg')
billb2.head()

,year,artist,track,time,date.entered,week,rationg
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk1,87.0
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,wk1,91.0
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,wk1,81.0
3,2000,3 Doors Down,Loser,4:24,2000-10-21,wk1,76.0
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,wk1,57.0

In [15]:
# .pivot() : 기존의 데이터프레임을 이용, 지정한 행과 열 기준으로 데이터를 배치하는 메서드
df2 = pd.DataFrame({
    'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    'baz': [1, 2, 3, 4, 5, 6]
})

df2

   foo bar  baz
0  one   A    1
1  one   B    2
2  one   C    3
3  two   A    4
4  two   B    5
5  two   C    6

In [16]:
ef = df2.pivot(index='foo', columns='bar', values='baz')
ef

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [17]:
ef.columns

Index(['A', 'B', 'C'], dtype='object', name='bar')

In [18]:
ef.columns.name

'bar'

In [19]:
ef.index

Index(['one', 'two'], dtype='object', name='foo')

In [20]:
ef.index.name

'foo'

In [21]:
# join() - index를 기준으로 데이터 세트를 합쳐 주는 메서드
import numpy as np

In [22]:
dfa = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                   index=['a', 'c', 'e'], columns=['Ohio', 'Nevada'])
dfa

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [23]:
dfb = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                   index=['e', 'c', 'd', 'b'], columns=['Misouri', 'Alabama'])
dfb

   Misouri  Alabama
e      7.0      8.0
c      9.0     10.0
d     11.0     12.0
b     13.0     14.0

In [25]:
join1 = dfa.join(dfb, how='outer')
join1

   Ohio  Nevada  Misouri  Alabama
a   1.0     2.0      NaN      NaN
b   NaN     NaN     13.0     14.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
e   5.0     6.0      7.0      8.0

In [26]:
join2 = dfa.join(dfb, how='inner')
join2

   Ohio  Nevada  Misouri  Alabama
c   3.0     4.0      9.0     10.0
e   5.0     6.0      7.0      8.0

In [27]:
join3 = dfa.join(dfb, how='left')
join3

   Ohio  Nevada  Misouri  Alabama
a   1.0     2.0      NaN      NaN
c   3.0     4.0      9.0     10.0
e   5.0     6.0      7.0      8.0

In [28]:
join4 = dfa.join(dfb, how='right')
join4

   Ohio  Nevada  Misouri  Alabama
e   5.0     6.0      7.0      8.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
b   NaN     NaN     13.0     14.0

In [29]:
join5 = dfa.join(dfb, how='right', sort=True)
join5

   Ohio  Nevada  Misouri  Alabama
b   NaN     NaN     13.0     14.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
e   5.0     6.0      7.0      8.0

In [30]:
# .concat() - 시리즈나 데이터프레임을 합쳐주는 메서드
s1 = pd.Series(['a', 'b'])
s1

0    a
1    b
dtype: object

In [31]:
s2 = pd.Series(['c', 'd'])
s2

0    c
1    d
dtype: object

In [32]:
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [33]:
pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object